fabrika.Основное/src/DataProcessors/ЗаполнениеРегистраДДС/ЗаполнениеРегистраДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаполнениеРегистраДДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Расшифровка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборЗаписейРегистраДДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СообщенияПользователю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РаспределениеПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДеньВДень</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоговорыКонтрагентов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СконвертированнаяСумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Курс</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fabrika.Основное/src/DataProcessors/ЗаполнениеРегистраДДС/Forms/Форма/Module.bsl
#Область Задолженности


&НаКлиенте
Процедура Расш1_Задолженности(Команда)
	
	
	Отбор = ПолучитьСтруктураОтбораСервер(Объект.Расшифровка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Расшифровка.Организация);
    ПараметрыФормы.Вставить("Период", Отбор.Период);
    
    Отбор.Удалить("Период");
    
    ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("КлючВарианта", Отбор.КлючВарианта);
			
	ОткрытьФорму("Отчет.ЗадолженностиПоТовару.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма, Истина, ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСтруктураОтбораСервер(Расшифровка)
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("КонтрагентИНН", Расшифровка.Получатель.ИНН);
	Отбор.Вставить("ТаможняЗадолженностиОрганизацияИНН", Расшифровка.Получатель.ИНН);
	Отбор.Вставить("ТаможняЗадолженностиКонтрагентИНН", Расшифровка.Организация.ИНН);
	//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
	
	ПериодОтчета = Новый СтандартныйПериод;
	ПериодОтчета.ДатаНачала = НачалоКвартала(ТекущаяДата());
	ПериодОтчета.ДатаОкончания = НачалоДня(ТекущаяДата());
	//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
	
    ПолучательОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", Расшифровка.Получатель.ИНН);
    Если ПолучательОрганизация <> Неопределено Тогда
        ПериодОтчета.ДатаНачала = ?(ПолучательОрганизация.ТипОрганизации = Перечисления.ТипОрганизации.Таможня, 
                                                                                              Дата("20170101"), 
                                                                                              ПериодОтчета.ДатаНачала);
    КонецЕсли;
    
	
	Если Расшифровка.Получатель.Родитель.Наименование = "ИП" Тогда
		КлючВарианта = "4d4478a6-38ca-47b2-92e6-2673fad6b092";
	Иначе	
		КлючВарианта = "ДляДДС";
		Отбор.Вставить("Период", ПериодОтчета);
		Отбор.Вставить("ПлановаяЗадолженность", Истина);
	КонецЕсли;
	Отбор.Вставить("КлючВарианта", КлючВарианта); 	
	//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
	
	
	Возврат Отбор;
	
	
КонецФункции



#КонецОбласти




&НаКлиенте
Процедура Расш1_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	строка = Элементы.РаспределениеПоСчетам.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(строка.НомерВБухгалтерии) Тогда
		Возврат;
	КонецЕсли;  
	 
	Если ВыбранноеЗначение.Свойство("ДоговорМод") Тогда 
		строка.ДоговорыКонтрагентов = ВыбранноеЗначение.ДоговорМод;
	КонецЕсли;	

	Если ВыбранноеЗначение.Свойство("Месяц") Тогда 
		строка.Комментарий = "за " + Формат(ВыбранноеЗначение.Месяц, "ДФ='MMMM yyyy'");
	КонецЕсли;	
        	 
		
КонецПроцедуры


////Дима 23.12.2017 17:32:48////Обновляет данные по счетам
&НаКлиенте
Процедура Расш1_Обновить(Команда)
	ОбновитьЗаполнениеПоСчетам(Неопределено, Неопределено);
КонецПроцедуры




//////////////////////////////////////РЕДАКТИРОВАНИЕ ВАЛЮТНЫХ ПЕРЕВОДОВ//////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура Расш1_РедактироватьВалютныйПлатежПеред(Команда)
	
	Если НЕ СоздаватьПлатёжныеДокументы(Контрагент) Тогда
		УстановитьВыполнениеОбработчиковСобытия(Ложь);
		РедактироватьСумму(Неопределено);
	КонецЕсли;	
	
	
КонецПроцедуры
//конец Дима
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////


&НаСервереБезКонтекста
Функция СоздаватьПлатёжныеДокументы(Контрагент)

  Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок", "Создавать платёжные документы");
  Значение = Контрагент.ДополнительныеРеквизиты.Найти(Свойство, "Свойство");
  
  Если Значение <> Неопределено Тогда
	  Возврат Значение.Значение;
  Иначе
	  Возврат Ложь;
  КонецЕсли;	  
	

КонецФункции // СоздаватьПлатёжныеДокументы()
